from scrapy import FormRequest, Request
from scrapy.linkextractors import LinkExtractor
from scrapy.spiders import CrawlSpider, Rule
from datetime import datetime

import logging
import json
import uuid
import copy
import urllib

from FunpySpiderSearch.sites.w51job.w51job_Item import W51JobItem, W51JobItemLoader
from FunpySpiderSearch.utils.common import get_md5


def get_uuid():
    return str(uuid.uuid4())

def urlencode(str):
    return urllib.parse.quote((urllib.parse.quote(str)))

# var url = window.cfg.domain.search + '/list/' + encodeURIComponent(encodeURIComponent(jobarea)) + ',000000,' +
# encodeURIComponent(encodeURIComponent(fun)) + ',' +
# encodeURIComponent(encodeURIComponent(ind)) + ',' +
# encodeURIComponent(encodeURIComponent(issuedate)) + ','+
# encodeURIComponent(encodeURIComponent(providesalary)) +',' +
# encodeURIComponent(encodeURIComponent(keyword)) + ',' +
# encodeURIComponent(encodeURIComponent(keywordtype)) +    # "1":"公司","2":"全文"
# ',1.html?lang=c&stype=&postchannel=' + postchannel +
#   '&workyear=' + workyear +
#   '&cotype=' + cotype +
#   '&degreefrom=' + degreefrom +
#   '&jobterm=' + jobterm +
#   '&companysize=' + companysize +
#   '&providesalary=' + providesalary +
#   '&lonlat='+ encodeURIComponent(lonlat) +
#   '&radius='+ encodeURIComponent(radius) +
#   '&ord_field='+ ord_field +
#   '&confirmdate=9&fromType=&dibiaoid='+ dibiaoid +
#   '&address='+ encodeURIComponent(address) +
#   '&line='+ encodeURIComponent(line) +
#   '&specialarea='+ specialarea +
#   '&from=&welfare='+encodeURIComponent(welfare);

CITY_MAP = {"北京":"010000","上海":"020000","广州":"030200","深圳":"040000","武汉":"180200","西安":"200200","杭州":"080200","南京":"070200","成都":"090200","重庆":"060000","东莞":"030800","大连":"230300","沈阳":"230200","苏州":"070300","昆明":"250200","长沙":"190200","合肥":"150200","宁波":"080300","郑州":"170200","天津":"050000","青岛":"120300","济南":"120200","哈尔滨":"220200","长春":"240200","福州":"110200","阿坝":"092200","阿克苏":"310600","阿拉尔":"310900","阿拉善盟":"281500","阿勒泰":"311300","阿里":"300800","鞍山":"230400","安康":"201000","安庆":"150400","安顺":"260500","安阳":"170900","巴彦淖尔":"280900","巴音郭楞":"311800","巴中":"092000","白城":"241000","白沙":"101800","白山":"240900","白银":"270800","百色":"141100","蚌埠":"150600","包头":"280400","保定":"160400","保山":"251200","保亭":"101700","宝鸡":"200400","北海":"140500","本溪":"231000","毕节":"260700","滨州":"121500","博尔塔拉":"311900","亳州":"151800","沧州":"160800","昌都":"300600","昌吉":"311200","昌江":"101900","常德":"190700","常熟":"070700","常州":"070500","长治":"210600","朝阳":"231400","潮州":"032000","郴州":"190900","澄迈":"101300","承德":"161000","池州":"151500","赤峰":"280300","崇左":"141400","滁州":"150900","楚雄":"251700","达州":"091700","大理":"250500","大庆":"220500","大同":"210400","大兴安岭":"221400","丹东":"230800","丹阳":"072100","德宏":"251600","德阳":"090600","德州":"121300","邓州":"172000","迪庆":"252000","定安":"101100","定西":"271100","东方":"100900","东营":"121000","儋州":"100800","鄂尔多斯":"280800","鄂州":"181000","恩施":"181800","防城港":"140800","佛山":"030600","抚顺":"230600","抚州":"131100","阜新":"231500","阜阳":"150700","甘南":"271500","甘孜":"092100","赣州":"130800","固原":"290600","广安":"091300","广元":"091600","桂林":"140300","贵港":"141000","贵阳":"260200","果洛":"320800","哈密":"310700","海北":"320500","海东":"320300","海口":"100200","海南":"320700","海宁":"081600","海西":"320400","邯郸":"160700","汉中":"200900","菏泽":"121400","和田":"311600","河池":"141200","河源":"032100","鹤壁":"171700","鹤岗":"221000","贺州":"141500","黑河":"221200","衡水":"161200","衡阳":"190500","红河州":"251000","呼和浩特":"280200","呼伦贝尔":"281100","葫芦岛":"230900","湖州":"080900","怀化":"191100","淮安":"071900","淮北":"151700","淮南":"151100","黄冈":"181100","黄南":"320600","黄山":"151000","黄石":"180400","惠州":"030300","鸡西":"220900","吉安":"130900","吉林":"240300","济宁":"120900","济源":"171900","嘉兴":"080700","嘉峪关":"270400","佳木斯":"220800","江门":"031500","焦作":"170500","揭阳":"032200","金昌":"270300","金华":"080600","锦州":"230700","晋城":"210700","晋中":"211000","荆门":"180800","荆州":"180700","景德镇":"130400","靖江":"072500","九江":"130300","酒泉":"270500","喀什地区":"310400","开封":"170400","开平":"032700","克拉玛依":"310300","克孜勒苏柯尔克孜":"311700","昆山":"070600","拉萨":"300200","莱芜":"121800","来宾":"141300","兰州":"270200","廊坊":"160300","乐山":"090400","丽江":"250600","丽水":"081000","连云港":"071200","凉山":"092300","聊城":"121700","辽阳":"231100","辽源":"240400","林芝":"300400","临沧":"251800","临汾":"210500","临高":"101400","临夏":"271400","临沂":"120800","陵水":"102100","柳州":"140400","六安":"151200","六盘水":"260400","龙岩":"111000","陇南":"271200","娄底":"191200","吕梁":"211200","洛阳":"170300","泸州":"090500","漯河":"171500","马鞍山":"150500","茂名":"032300","梅州":"032600","眉山":"091200","绵阳":"090300","牡丹江":"220700","那曲":"300700","南昌":"130200","南充":"091100","南宁":"140200","南平":"110800","南通":"070900","南阳":"170600","内江":"090900","宁德":"110900","怒江":"251900","攀枝花":"091000","盘锦":"231300","萍乡":"130500","平顶山":"171000","平凉":"271000","莆田":"110600","普洱":"251100","濮阳":"171600","七台河":"221300","齐齐哈尔":"220600","黔东南":"260900","黔南":"261000","黔西南":"260800","潜江":"181500","钦州":"140900","秦皇岛":"160600","清远":"031900","庆阳":"271300","琼海":"100600","琼中":"101600","曲靖":"250300","泉州":"110400","衢州":"081200","日喀则":"300300","日照":"121200","三门峡":"171800","三明":"110700","三沙":"101500","三亚":"100300","山南":"300500","汕头":"030400","汕尾":"032400","商洛":"201100","商丘":"171300","上饶":"131200","韶关":"031400","邵阳":"191000","绍兴":"080500","神农架":"181700","十堰":"180600","石河子":"310800","石家庄":"160200","石嘴山":"290500","双鸭山":"221100","朔州":"210900","四平":"240600","松原":"240700","宿迁":"072000","宿州":"151600","随州":"181200","绥化":"220400","遂宁":"091500","塔城":"311500","台州":"080800","泰安":"121100","泰兴":"072300","泰州":"071800","太仓":"071600","太原":"210200","唐山":"160500","天门":"181600","天水":"270600","铁岭":"231200","通化":"240500","通辽":"280700","铜川":"200500","铜陵":"150800","铜仁":"260600","图木舒克":"311100","吐鲁番":"311400","屯昌":"101200","万宁":"100700","威海":"120600","潍坊":"120500","渭南":"200700","温州":"080400","文昌":"100500","文山":"251400","乌海":"281000","乌兰察布":"281200","乌鲁木齐":"310200","无锡":"070400","芜湖":"150300","梧州":"140700","吴忠":"290300","武威":"270700","五家渠":"311000","五指山":"101000","西昌":"091900","西宁":"320200","西双版纳":"251500","锡林郭勒盟":"281400","厦门":"110300","仙桃":"181400","咸宁":"181300","咸阳":"200300","襄阳":"180500","湘潭":"190400","湘西":"191500","孝感":"180900","新乡":"170700","新余":"130600","忻州":"211100","信阳":"171200","兴安盟":"281300","邢台":"161100","雄安新区":"160100","徐州":"071100","许昌":"171100","宣城":"151400","乐东":"102000","雅安":"091800","烟台":"120400","盐城":"071300","延安":"200600","延边":"241100","延吉":"240800","燕郊开发区":"161300","杨凌":"201200","扬州":"070800","洋浦经济开发区":"100400","阳江":"032800","阳泉":"210800","伊春":"220300","伊犁":"310500","宜宾":"090700","宜昌":"180300","宜春":"131000","义乌":"081400","益阳":"190800","银川":"290200","鹰潭":"130700","营口":"230500","永州":"191300","榆林":"200800","玉林":"140600","玉树":"320900","玉溪":"250400","岳阳":"190600","云浮":"032900","运城":"210300","枣庄":"121600","湛江":"031700","漳州":"110500","张家港":"071400","张家界":"191400","张家口":"160900","张掖":"270900","昭通":"251300","肇庆":"031800","镇江":"071000","中山":"030700","中卫":"290400","舟山":"081100","周口":"170800","珠海":"030500","株洲":"190300","驻马店":"171400","资阳":"091400","淄博":"120700","自贡":"090800","遵义":"260300","广东省":"030000","江苏省":"070000","浙江省":"080000","四川省":"090000","海南省":"100000","福建省":"110000","山东省":"120000","江西省":"130000","广西":"140000","安徽省":"150000","河北省":"160000","河南省":"170000","湖北省":"180000","湖南省":"190000","陕西省":"200000","山西省":"210000","黑龙江省":"220000","辽宁省":"230000","吉林省":"240000","云南省":"250000","贵州省":"260000","甘肃省":"270000","内蒙古":"280000","宁夏":"290000","西藏":"300000","新疆":"310000","青海省":"320000","香港":"330000","澳门":"340000","台湾":"350000","国外":"360000"}


class W51Jobspider(CrawlSpider):
    max_start_request_num = 50

    search_city = '长沙'
    search_keyword = ['js', '全栈', 'golang', 'php', 'python', '前端']
    # search_keyword = ['js']

    name = 'w51job'
    allowed_domains = ['search.51job.com', 'jobs.51job.com']
    agent = "Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/" \
            "537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36"
    custom_settings = {
        "COOKIES_ENABLED": True,
        "COOKIES_DEBUG": False,
        "REFERER_ENABLED": False,
        "DOWNLOAD_DELAY": 1,
        'DEFAULT_REQUEST_HEADERS': {
            'Accept': 'application/json, text/javascript, */*; q=0.01',
            'Accept-Encoding': 'gzip, deflate, br',
            'Accept-Language': 'zh-CN,zh;q=0.8',
            'Connection': 'keep-alive',
            'Origin': 'https://www.51job.com',
            'Referer': 'https://www.51job.com/',
            'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 '
                          '(KHTML, like Gecko) Chrome/61.0.3163.100 Safari/537.36',
        }
    }

    myCookies = {
        'guid': 'e4d320791a75e32fbf1cc255aebe1d2a',
    }

    def start_requests(self):
        kds = self.search_keyword
        city = urlencode(CITY_MAP[self.search_city])
        headers = self.custom_settings['DEFAULT_REQUEST_HEADERS']
        headers['Referer'] = 'https://search.51job.com/list/141300%252C01,000000,0000,00,9,99,PHP%2520%25E4%25B8%25AD%25E7%25BA%25A7%25E5%25BC%2580%25E5%258F%2591,2,1.html?lang=c&stype=&postchannel=0000&workyear=99&cotype=99&degreefrom=99&jobterm=99&companysize=99&providesalary=99&lonlat=0%2C0&radius=-1&ord_field=0&confirmdate=9&fromType=&dibiaoid=0&address=&line=&specialarea=00&from=&welfare='
        url = "https://search.51job.com/list/%s,000000,0000,00,9,99,%s,2,%s.html"
        query = "?lang=c&stype=&postchannel=0000&workyear=99&cotype=99&degreefrom=99&jobterm=99&companysize=99&providesalary=99&lonlat=0%2C0&radius=-1&ord_field=0&confirmdate=9&fromType=&dibiaoid=0&address=&line=&specialarea=00&from=&welfare="

        reqUrls = []
        
        for num in range(self.max_start_request_num):
            for kd in kds:
                rurl = (url % (city, urlencode(kd), num+1)) + query
                reqUrls.append(Request(url=rurl,
                        cookies=self.myCookies,
                        headers=headers))        
        return reqUrls

    rules = (
        Rule(LinkExtractor(allow=r'/\d+\.html\?'), callback='parse_content', follow=False),
    )

    @staticmethod
    def parse_content(response):
        item_loader = W51JobItemLoader(item=W51JobItem(), response=response)
        item_loader.add_css("title", "div.cn > h1::text")
        item_loader.add_value("url", response.url)
        item_loader.add_value("url_object_id", get_md5(response.url))
        item_loader.add_css("salary_min", "div.cn > strong::text")
        item_loader.add_css("job_city", "p.msg.ltype::text")
        item_loader.add_css("job_advantage", "div.tHeader.tHjob div.t1>.sp4::text")
        item_loader.add_css("job_desc", "div.tCompany_main div.job_msg")
        item_loader.add_xpath("job_addr", "//*[@class='tBorderTop_box'][2]/div/p[@class='fp']/text()")
        item_loader.add_css("company_name", "p.cname>a.catn::attr(title)")
        item_loader.add_css("company_url", "p.cname>a.catn::attr(href)")
        item_loader.add_value("crawl_time", datetime.now())

        job_item = item_loader.load_item()

        return job_item
